package tennis;

public class Condition {
	public static void main(String[] args) {
		/*
		4포인트(0(Love)>15>30>40) 획득 후 한점 더 획득 시 -> 1게임 획득
		6게임 획득 -> 1세트 획득
		
		듀스 포인트 - 40:40 -> 40:A(어드밴티지 포인트에서 딴 쪽이 1게임 획득)
		게임스코어 5:5시 듀스 => 7:5로 이겨야함
		게임스코어 6:6 시 타이브레이크로 먼저 7점 획득한 쪽이 세트 획득
		
		?
		- 게임스코어 6:6이 되면 타이브레이크로 먼저 7점을 얻는 사람이 세트를 따게 됩니다.
		- 타이 브레이크 6:6 상황도 2포인트를 먼저 따야 합니다. (1점을 앞서나가면 애드A, 다시 동점이 되면 듀스입니다)
		?

		#남자 단식
		-	ATP 대회는 3세트 2선승제
		-	그랜드슬램 대회는 5세트 3선승제(5판 3승)로 진행됩니다.
		
		#여자 단식과 복식
		-	ATP, 그랜드슬램 모두 3세트 2선승제(3판 2승) 입니다.
		=> 대충 3세트 2선승제로 통일.

		게임스코어가 홀수일 때, 1,3,5,7,9 코트를 체인지
		게임의 마지막 세트는 끝장 게임으로 2게임이상 차이가 나야만 매치포인트(Match Point)로 승부가 결정



			
		*용어
		브레이크 포인트 : 상대방 서브권에서의 게임을 가져오는 것을 말한다.
		타이 브레이크 : 게임 스코어 6:6 상황 시 0:0부터 7점을 먼저 내는쪽이 게임을 가져감.
		더블 폴트 : 2번의 기회가 주어지는 서브를 모두 놓친 것.
		에이스 : 
		
		
		*/
	}
}
